# Напишите функцию, возвращающую наибольшее из двух чисел
n=""
def max2(n1, n2):
    pass
    if n1<=n2 :
        print("n=",n2)
    else :
        print("n=",n1)
    return n
print(max2(5, 6))
print(max2(-10, -12))
print(max2(2.5, 2.6))
print(max2(-2.5, 0))
print(max2(0, -2.5))
